Catalogs/ПрожиточныеМинимумы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПрожиточныеМинимумы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
	</Catalog>
</MetaDataObject>

InformationRegisters/ВеличинаПрожиточногоМинимума.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВеличинаПрожиточногоМинимума</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПрожиточныйМинимум</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрожиточныеМинимумы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПрожиточныеМинимумы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура НачальноеЗаполнение() Экспорт
	
	ОбновитьПрожиточныеМинимумы();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обновляет справочник Прожиточные минимумы из макета.
//
Процедура ОбновитьПрожиточныеМинимумы() Экспорт
	
	ТаблицаДанных = ДанныеПрожиточныхМинимумовИзМакета();
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассификаторТаблица.НаименованиеПрожиточногоМинимума КАК НаименованиеПрожиточногоМинимума,
		|	КлассификаторТаблица.Дата КАК Дата,
		|	КлассификаторТаблица.Размер КАК Размер
		|ПОМЕСТИТЬ КлассификаторТаблица
		|ИЗ
		|	&КлассификаторТаблица КАК КлассификаторТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрожиточныеМинимумы.Ссылка КАК ПрожиточныйМинимум,
		|	КлассификаторТаблица.НаименованиеПрожиточногоМинимума КАК НаименованиеПрожиточногоМинимума,
		|	КлассификаторТаблица.Дата КАК Период,
		|	КлассификаторТаблица.Размер КАК Размер
		|ИЗ
		|	КлассификаторТаблица КАК КлассификаторТаблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрожиточныеМинимумы КАК ПрожиточныеМинимумы
		|		ПО КлассификаторТаблица.НаименованиеПрожиточногоМинимума = ПрожиточныеМинимумы.Наименование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВеличинаПрожиточногоМинимума КАК ВеличинаПрожиточногоМинимума
		|		ПО (ПрожиточныеМинимумы.Ссылка = ВеличинаПрожиточногоМинимума.ПрожиточныйМинимум)
		|			И КлассификаторТаблица.Дата = ВеличинаПрожиточногоМинимума.Период
		|ГДЕ
		|	ВеличинаПрожиточногоМинимума.Размер ЕСТЬ NULL
		|	ИЛИ ВеличинаПрожиточногоМинимума.Размер = 0";
	
	Запрос.УстановитьПараметр("КлассификаторТаблица", ТаблицаДанных);
	
	НаборЗаписей = РегистрыСведений.ВеличинаПрожиточногоМинимума.СоздатьНаборЗаписей();
	
	КлючиРегистра = Новый Массив;
	КлючиРегистра.Добавить("ПрожиточныйМинимум");
	КлючиРегистра.Добавить("Период");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей.Очистить();
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		Для Каждого Ключ Из КлючиРегистра Цикл 
			НаборЗаписей.Отбор[Ключ].Установить(Выборка[Ключ]);
		КонецЦикла;
		НаборЗаписей.Записать(Истина);
	КонецЦикла;

КонецПроцедуры

// Преобразовывает данные прожиточного минимума, поставляемые в виде макета в конфигурации.
//
// Параметры:
//	 ФормироватьПолныйНабор - необязательный, булево, если ложь, то будут сформированы только данные по отклонениям по умолчанию.
//
// Возвращаемое значение:
//  ТаблицаЗначений - см. ДанныеПрожиточныхМинимумовИзXML.
//
Функция ДанныеПрожиточныхМинимумовИзМакета() Экспорт
	
	ТекстовыйДокумент = Справочники.ПрожиточныеМинимумы.ПолучитьМакет("ВеличинаПрожиточногоМинимума");
	
	Возврат ДанныеПрожиточныхМинимумовИзXML(ТекстовыйДокумент.ПолучитьТекст());
	
КонецФункции

// Преобразовывает данные прожиточных минимумов, представленные в виде XML.
//
// Параметры:
//	 XML - документ с данными.
//	 ФормироватьПолныйНабор - необязательный, булево, если ложь, то будут сформированы только данные по отклонениям по умолчанию.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с колонками:
//	* Наименование прожиточного минимум
//	* Размер
//	* Дата
//
Функция ДанныеПрожиточныхМинимумовИзXML(Знач XML) Экспорт
	
	ТаблицаДанных = НовыеДанныеПрожиточногоМинимума();
	ТаблицаДанныхПоУмолчанию = ОбщегоНазначения.ПрочитатьXMLВТаблицу(XML).Данные;
	
	Для Каждого СтрокаДанных Из ТаблицаДанныхПоУмолчанию Цикл
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.НаименованиеПрожиточногоМинимума = СтрокаДанных.LivingWage;
		НоваяСтрока.Размер = СтрокаДанных.Size;
		НоваяСтрока.Дата = Дата(СтрокаДанных.Date);
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция НовыеДанныеПрожиточногоМинимума()
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("НаименованиеПрожиточногоМинимума", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	ТаблицаДанных.Колонки.Добавить("Размер", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	Возврат ТаблицаДанных;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
